<?php

$news = [
    [
        'code' => 1,
        'title' => 'Вчені створили робота, який вивчає мову схожу на людську',
        'summary' => 'Дослідники заявляють про створення робота, який може спілкуватися мовою, схожою на людську.',
        'text' => 'Учені з різних країн працюють над створенням роботів, які можуть спілкуватися з людьми більш природним способом. Цей новий робот використовує штучний інтелект для аналізу мови і відповіді на запитання в реальному часі.',
        'date' => '2023-09-22',
        'views' => 200,
    ],
    [
        'code' => 2,
        'title' => 'Штучний інтелект допомагає в боротьбі зі злочинністю',
        'summary' => 'Системи штучного інтелекту допомагають правоохоронним органам виявляти та розкривати злочини.',
        'text' => 'За допомогою аналізу даних та алгоритмів машинного навчання, системи штучного інтелекту стають надійними інструментами для боротьби зі злочинністю. Вони допомагають виявляти злочини на ранніх стадіях та надають цінну інформацію правоохоронцям.',
        'date' => '2023-09-21',
        'views' => 180,
    ],
    [
        'code' => 3,
        'title' => 'Штучний інтелект вдосконалює медичну діагностику',
        'summary' => 'Системи штучного інтелекту допомагають лікарям виявляти хвороби на ранніх стадіях.',
        'text' => 'Лікарі використовують штучний інтелект для аналізу медичних зображень та діагностики хвороб. Це дозволяє виявляти патології на ранніх стадіях, забезпечуючи більш успішне лікування пацієнтів.',
        'date' => '2023-09-20',
        'views' => 220,
    ],
];

if ($_SERVER['REQUEST_METHOD'] === 'POST') {
    // Перевірка, що всі необхідні поля були заповнені
    if (isset($_POST['title']) && isset($_POST['summary']) && isset($_POST['text']) && isset($_POST['date']) && isset($_POST['views'])) {
        // Створення нової новини
        $newArticle = [
            'code' => count($news) + 1,
            'title' => $_POST['title'],
            'summary' => $_POST['summary'],
            'text' => $_POST['text'],
            'date' => $_POST['date'],
            'views' => $_POST['views'],
        ];

        // Додавання нової новини 
        $news[] = $newArticle;
    }
}
$news = array_filter($news, function ($element) {
    $return_flag = true;
    
    if (isset($_GET['min_views']) && $element['views'] < $_GET['min_views']) {
        $return_flag = false;
    }
    
    if (isset($_GET['date']) && $element['date'] != $_GET['date']) {
        $return_flag = false;
    }
    
    return $return_flag;
});




include 'templates/news_table.phtml';
include 'templates/news_form_create.phtml';
?>